talent518/STM32F103C8T6/src/Timer.c
#include <stm32f10x_tim.h>

#include "IWDG.h"
#include "LED.h"
#include "COM.h"
#include "Timer.h"
#include "RTC.h"

vu32 milliseconds = 0;

/***************************************************************
*	功能：定时器3初始化为每隔Nms中断一次的方式。
*	参数：Period中断时间的长度，如果Period=N*10，那么每隔N毫秒中断一次。
**************************************************************/
void Timer3Init(u16 Period)
{
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	NVIC_InitTypeDef NVIC_InitStructure;

	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE); // 时钟使能

	TIM_TimeBaseStructure.TIM_Period = Period; // 设置在下一个更新事件装入活动的自动重装载寄存器周期的值	 计数到N*10为Nms
	TIM_TimeBaseStructure.TIM_Prescaler = (72 - 1); // 设置用来作为TIMx时钟频率除数的预分频值  10Khz的计数频率
	TIM_TimeBaseStructure.TIM_ClockDivision = 0; // 设置时钟分割:TDTS = Tck_tim
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;  // TIM向上计数模式
	TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure); // 根据TIM_TimeBaseInitStruct中指定的参数初始化TIMx的时间基数单位

	TIM_ITConfig(TIM3, TIM_IT_Update | TIM_IT_Trigger, ENABLE);  //使能
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);

	// 配置中断优先级
	NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn;  //TIM3中断
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;  //先占优先级0级
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;  //从优先级3级
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE; //IRQ通道被使能
	NVIC_Init(&NVIC_InitStructure);  //根据NVIC_InitStruct中指定的参数初始化外设NVIC寄存器

	TIM_Cmd(TIM3, ENABLE);  //使能TIMx外设
}

void TIM3_IRQHandler(void)
{
	static u16 n = 0, alarm = 0;

	if(TIM_GetITStatus(TIM3, TIM_IT_Update) != RESET)
	{
		TIM_ClearITPendingBit(TIM3, TIM_IT_Update);
		
		milliseconds ++;
		
		COM_RunCmd();
		
		if(++ n >= 100)
		{
			n = 0;
			
			if(is_alarm) {
				if(++alarm >= 100) {
					is_alarm = 0;
					alarm = 0;
					LED_SetAlarm(0);
				} else {
					LED_SetAlarm(alarm % 2);
				}
			}
			
			COM_ClearLine = 0;
			{
				u32 sec1 = milliseconds / 100, sec2 = sec1 / 10, sec3 = sec1 % 10;
				
				RTC_Get(); // 更新时间
				COM_printf("\033[2KSeconds: %u.%u, RTC: %u-%02u-%02u %02u:%02u:%02u.%03u\r", sec2, sec3, calendar.year, calendar.month, calendar.day, calendar.hour, calendar.min, calendar.sec, calendar.msec);
			}
			
			COM_ClearLine = 1;
		}
		
		DMA_SendData();

		IWDG_FeedDog();
	}
}
